In [ ]:
#pip install psycopg2

In [21]:
import pandas as pd
import sqlalchemy
import psycopg2

In [22]:
from sqlalchemy import create_engine

pw="****"
pw = "3Jc"

# Connect to the database
engine = create_engine(f'postgresql://researcher:{pw}@web-of-science-5d44-db.c.dartmouth.edu:5432/wos')

test_conn_limit80 = pd.read_sql_query("select * from public.wos_reviewed_languages wrl limit 80", engine)
test_conn_limit80.head(3)

                    id  language_id language
0  WOS:000204891200055            0  English
1  WOS:000203532200036            0  English
2  WOS:000203120600015            0  English

In [50]:
# Read CSV into a DataFrame

csv_subset_df = pd.read_csv("data/res_ids_subset.csv")

csv_full_df = pd.read_csv("data/DA_res_ids_2025-06-10.csv")

# NOTE: set to subset or full / depending on testing or running full dataset 
csv_df = csv_subset_df 

csv_df.head(3)

          res_id
0  GGT-1263-2022
1  GBL-7870-2022
2  AAI-5181-2021

In [54]:
# convert CSV data grame to a list for the SQL 'where' clause 
#ids = csv_df['res_id'].astype(str).tolist()

ids = csv_df['res_id'].astype(str).tolist()
escaped_ids = [id_val.replace("'", "''") for id_val in ids]
in_clause = ", ".join(f"'{val}'" for val in escaped_ids)
where_clause = f"WHERE wc.r_id IN ({in_clause})"
print(where_clause)

sql_query = f"SELECT distinct on (wc.id, wt.title) * FROM wos_contributors wc join wos_titles wt on wc.id = wt.id {where_clause};"

#sql_query = f"SELECT distinct on (wc.id, wt.title) wc.id, wt.title, wc.display_name \
#    FROM wos_contributors wc join wos_titles wt on wc.id = wt.id {where_clause};"

#sql_query = f"SELECT distinct wc.id, wt.title FROM wos_contributors wc join wos_titles wt on wc.id = wt.id {where_clause};"

# select * from public.wos_contributors wc  limit 3
 
# SELECT distinct wc.id, wt.title FROM wos_contributors wc join wos_titles wt on wc.id = wt.id WHERE r_id IN ('GGT-1263-2022', 'EER-8175-2022');


print(sql_query)

WHERE wc.r_id IN ('GGT-1263-2022', 'GBL-7870-2022', 'AAI-5181-2021', 'GBH-2776-2022', 'HVL-4819-2023', 'U-2811-2019', 'O-8311-2018', 'GGO-5361-2022', 'GEC-4561-2022', 'H-4343-2019', 'EIT-6374-2022', 'CUJ-4805-2022', 'EWD-7185-2022', 'LGZ-1871-2024', 'IXW-9642-2023', 'AGV-9029-2022', 'LTR-3089-2024', 'MNH-3788-2025', 'B-7156-2016', 'DVU-4922-2022', 'FVW-7852-2022', 'FXQ-7161-2022', 'IMY-2058-2023', 'EER-8175-2022')
SELECT distinct on (wc.id, wt.title) * FROM wos_contributors wc join wos_titles wt on wc.id = wt.id WHERE wc.r_id IN ('GGT-1263-2022', 'GBL-7870-2022', 'AAI-5181-2021', 'GBH-2776-2022', 'HVL-4819-2023', 'U-2811-2019', 'O-8311-2018', 'GGO-5361-2022', 'GEC-4561-2022', 'H-4343-2019', 'EIT-6374-2022', 'CUJ-4805-2022', 'EWD-7185-2022', 'LGZ-1871-2024', 'IXW-9642-2023', 'AGV-9029-2022', 'LTR-3089-2024', 'MNH-3788-2025', 'B-7156-2016', 'DVU-4922-2022', 'FVW-7852-2022', 'FXQ-7161-2022', 'IMY-2058-2023', 'EER-8175-2022');

In [55]:
da_subset_join_res_id = pd.read_sql_query(sql_query, engine)
da_subset_join_res_id.head(2)

,id,name_id,role,seq_no,r_id,orcid_id,display_name,full_name,first_name,last_name,id,title_id,title_type,title
0,WOS:000079984200005,0,researcher_id,1,H-4343-2019,0000-0002-7398-2127,"Masel, Joanna","Masel, Joanna",Joanna,Masel,WOS:000079984200005,3,abbrev_11,BIOPHYS CH
1,WOS:000079984200005,0,researcher_id,1,H-4343-2019,0000-0002-7398-2127,"Masel, Joanna","Masel, Joanna",Joanna,Masel,WOS:000079984200005,2,abbrev_iso,Biophys. Chem.

In [ ]:
# Step 3: Execute the query and load results into a DataFrame
#df = pd.read_sql_query(sql_query, conn)

# Step 4: Export DataFrame to CSV
# csv_path = "output.csv"
# da_subset_join_res_id.to_csv(csv_path, index=False)

In [ ]:
# extra code 
# 
# 
#  csv_df = pd.read_csv("data/res_ids_subset.csv")


# Connect to the database
#conn = sqlite3.connect(db_path)

# Query SQL table into a DataFrame
#sql_df = pd.read_sql_query("SELECT * FROM sql_table", conn)


# sql_df = pd.read_sql_query("select count(*) from public.wos_summary  wa ", engine)
# sql_df

# #'AAD-8114-2020', 'CRN-4036-2022'

# #-- 4,402 records 


# sql_string = "SELECT distinct wc.id, wt.title " \
# "FROM wos_contributors wc join wos_titles wt on wc.id = wt.id " \
# "WHERE r_id IN ('AAD-8114-2020', 'CRN-4036-2022');"

# res_id_join = pd.read_sql_query(sql_string, engine)
# res_id_join.head(2)
# 3.7s 

# Perform merge (join) on 'ID'
#merged_df = pd.merge(sql_df, csv_df, on='ID', how='inner')  # use 'left', 'right', or 'outer' for other joins

# Close the connection
#conn.close()

# Display or further process merged_df
#print(merged_df.head())

# Example of using it to query SQL (simplified)
#sql_query = f"SELECT * FROM some_table {where_clause};"

In [ ]:
# # Step 3: Execute the query and load results into a DataFrame
# df = pd.read_sql_query(sql_query, conn)

# # Step 4: Export DataFrame to CSV
# csv_path = "output.csv"
# df.to_csv(csv_path, index=False)

# print(f"Query results exported to {csv_path}")

# # Step 5: Close the connection
# conn.close()

In [ ]:
""" SELECT DISTINCT ON (wc.id, wt.title) 
       wc.id, wt.title, wc.field1, wt.field2, wc.field3, wt.field4
FROM wos_contributors wc 
JOIN wos_titles wt ON wc.id = wt.id 
WHERE r_id IN ('GGT-1263-2022', 'EER-8175-2022')
ORDER BY wc.id, wt.title, -- some criteria to pick which row
         wc.some_date DESC; -- example: latest row preferred """